In [93]:
import numpy as np
import pandas as pd

from sklearn.model_selection import cross_val_score
from sklearn.linear_model import LogisticRegression

import seaborn as sns

In [94]:

df = pd.read_csv('train (1).csv')[['Age','Pclass','SibSp','Parch','Survived']]

In [95]:
df.head()

    Age  Pclass  SibSp  Parch  Survived
0  22.0       3      1      0         0
1  38.0       1      1      0         1
2  26.0       3      0      0         1
3  35.0       1      1      0         1
4  35.0       3      0      0         0

In [96]:
df.dropna(inplace=True)

In [97]:
df.head()

    Age  Pclass  SibSp  Parch  Survived
0  22.0       3      1      0         0
1  38.0       1      1      0         1
2  26.0       3      0      0         1
3  35.0       1      1      0         1
4  35.0       3      0      0         0

In [98]:
X = df.iloc[:,0:4]
y = df.iloc[:,-1]

In [99]:
X.head()

    Age  Pclass  SibSp  Parch
0  22.0       3      1      0
1  38.0       1      1      0
2  26.0       3      0      0
3  35.0       1      1      0
4  35.0       3      0      0

In [100]:
np.mean(cross_val_score(LogisticRegression(),X,y,cv=20,scoring='accuracy'))

0.6933333333333332

## Applying Feature Construction

In [101]:
X['family_size'] = X['SibSp']+X['Parch']+1
# Family = sibling&spouse + parent&child + himself

In [102]:
X.head()

    Age  Pclass  SibSp  Parch  family_size
0  22.0       3      1      0            2
1  38.0       1      1      0            2
2  26.0       3      0      0            1
3  35.0       1      1      0            2
4  35.0       3      0      0            1

In [103]:
def family(num):
    if num==0:
        # Alone
        return 0
    elif num>1 and num<=4:
        # Samll family
        return 1
    else:
        # Large family
        return 2

In [104]:
family(4)

1

In [105]:
X['Family_type'] = X['family_size'].apply(family)

In [106]:
X.head()

    Age  Pclass  SibSp  Parch  family_size  Family_type
0  22.0       3      1      0            2            1
1  38.0       1      1      0            2            1
2  26.0       3      0      0            1            2
3  35.0       1      1      0            2            1
4  35.0       3      0      0            1            2

In [107]:

X.drop(columns=['SibSp','Parch','family_size'],inplace=True)

In [108]:
X.head()

    Age  Pclass  Family_type
0  22.0       3            1
1  38.0       1            1
2  26.0       3            2
3  35.0       1            1
4  35.0       3            2

In [109]:
np.mean(cross_val_score(LogisticRegression(),X,y,cv=20,scoring='accuracy'))

0.7326587301587301

In [110]:
# Here due to Feature construction ,accuracy rose from 69 to 73
# So everytime working on data , keep checking if i can apply feature construction or not

### Feature Splitting

In [111]:
df = pd.read_csv('train (1).csv')

In [112]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [113]:
df['Name']

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [114]:
# Here surname is before comma
# so we will split it according

In [115]:
df['Surname'] = df['Name'].str.split(',',expand=True)[0]

In [116]:
# When we split we get 2 thing here - before comma(',') and after comma(',')
df['Name'].str.split(',',expand=True)
# So to get the surname we extract the 0th column

             0                                            1
0       Braund                              Mr. Owen Harris
1      Cumings   Mrs. John Bradley (Florence Briggs Thayer)
2    Heikkinen                                  Miss. Laina
3     Futrelle           Mrs. Jacques Heath (Lily May Peel)
4        Allen                            Mr. William Henry
..         ...                                          ...
886   Montvila                                  Rev. Juozas
887     Graham                         Miss. Margaret Edith
888   Johnston               Miss. Catherine Helen "Carrie"
889       Behr                              Mr. Karl Howell
890     Dooley                                  Mr. Patrick

[891 rows x 2 columns]

In [117]:
# Here designation is after comma and before dot
# so we will split it according

In [118]:
df['Title'] = df['Name'].str.split(', ',expand=True)[1].str.split('.',expand=True)[0]

In [119]:
df['Name'].str.split(', ',expand=True)[1].str.split('.',expand=True)[0]

0        Mr
1       Mrs
2      Miss
3       Mrs
4        Mr
       ...
886     Rev
887    Miss
888    Miss
889      Mr
890      Mr
Name: 0, Length: 891, dtype: object

In [120]:
# Here name is after dot
# so we will split it according

In [121]:
df['Original_Name'] = df['Name'].str.split('.',expand=True)[1]

In [122]:
df['Name'].str.split('.',expand=True)
# First part is the name

                   0                                       1     2
0         Braund, Mr                             Owen Harris  None
1       Cumings, Mrs   John Bradley (Florence Briggs Thayer)  None
2    Heikkinen, Miss                                   Laina  None
3      Futrelle, Mrs           Jacques Heath (Lily May Peel)  None
4          Allen, Mr                           William Henry  None
..               ...                                     ...   ...
886    Montvila, Rev                                  Juozas  None
887     Graham, Miss                          Margaret Edith  None
888   Johnston, Miss                Catherine Helen "Carrie"  None
889         Behr, Mr                             Karl Howell  None
890       Dooley, Mr                                 Patrick  None

[891 rows x 3 columns]

In [123]:
df[['Title','Name','Surname','Original_Name']]

,Title,Name,Surname,Original_Name
0,Mr,"Braund, Mr. Owen Harris",Braund,Owen Harris
1,Mrs,"Cumings, Mrs. John Bradley (Florence Briggs Th...",Cumings,John Bradley (Florence Briggs Thayer)
2,Miss,"Heikkinen, Miss. Laina",Heikkinen,Laina
3,Mrs,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",Futrelle,Jacques Heath (Lily May Peel)
4,Mr,"Allen, Mr. William Henry",Allen,William Henry
...,...,...,...,...
886,Rev,"Montvila, Rev. Juozas",Montvila,Juozas
887,Miss,"Graham, Miss. Margaret Edith",Graham,Margaret Edith
888,Miss,"Johnston, Miss. Catherine Helen ""Carrie""",Johnston,"Catherine Helen ""Carrie"""
889,Mr,"Behr, Mr. Karl Howell",Behr,Karl Howell
890,Mr,"Dooley, Mr. Patrick",Dooley,Patrick

In [124]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Surname,Title,Original_Name
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Braund,Mr,Owen Harris
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Cumings,Mrs,John Bradley (Florence Briggs Thayer)
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Heikkinen,Miss,Laina
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Futrelle,Mrs,Jacques Heath (Lily May Peel)
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Allen,Mr,William Henry

In [132]:
df.groupby('Title')['Survived'].mean().sort_values(ascending=False)

Title
the Countess    1.000000
Mlle            1.000000
Sir             1.000000
Ms              1.000000
Lady            1.000000
Mme             1.000000
Mrs             0.792000
Miss            0.697802
Master          0.575000
Col             0.500000
Major           0.500000
Dr              0.428571
Mr              0.156673
Jonkheer        0.000000
Rev             0.000000
Don             0.000000
Capt            0.000000
Name: Survived, dtype: float64

In [133]:
# Creating new column named is married
df['Is_Married'] = 0
df['Is_Married'].loc[df['Title']=='Mrs']=1

C:\Users\godsc\AppData\Local\Temp\ipykernel_22268\1496887449.py:3: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df['Is_Married'].loc[df['Title']=='Mrs']=1
C:\Users\godsc\AppData\Local\Temp\ipykernel_22268\1496887449.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Is_Married'].loc[df['Title']=='Mrs']=1

In [134]:
df['Is_Married']

0      0
1      1
2      0
3      1
4      0
      ..
886    0
887    0
888    0
889    0
890    0
Name: Is_Married, Length: 891, dtype: int64